app/controllers/cards_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @list = List.find(params[:list_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."card_id" = $1  ORDER BY "comments"."id" ASC LIMIT 3  [["card_id", 1]]
---
  def show
    render json: { card: @card, card_comments: @card.comments.first_three }

INSERT INTO "cards" ("title", "list_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "title1 updateD!"], ["list_id", 17], ["user_id", 5]]
---
  def create
    @card = @list.cards.new(card_params)
    @card.user = current_user
    if @card.save

UPDATE "cards" SET "title" = $1 WHERE "cards"."id" = $2  [["title", "card 1"], ["id", 83]]
---
  def update
    if @card.update(card_params)

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 83]]
---
  def destroy
    if @card
      @card.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "cards".* FROM "cards" INNER JOIN "comments" ON "comments"."card_id" = "cards"."id" WHERE "cards"."list_id" = $1  [["list_id", 1]]
---
  def set_attrinutes
    @list = List.find_by(id: params[:list_id])
    @card = @list.cards.find_by(id: params[:id])