app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."card_id" = $1  [["card_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."card_id" = $1  [["card_id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", nil]]
---
  def index
    if params[:comment_id].nil?
      render json: {
        comments: @card.comments.paginate(page: params[:page], per_page: 3)
      }, statues: :ok
    else
      @comment = Comment.find(params[:comment_id])

INSERT INTO "comments" ("content", "replay_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Comment random"], ["replay_id", 20], ["created_at", "2018-09-09 13:49:09.942729"], ["updated_at", "2018-09-09 13:49:09.942729"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user = current_user
    if params[:comment_id].nil?
      @comment.card_id = @card.id
    else
      @comment.replay_id = params[:comment_id]
    end

    if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 343]]
---
  def destroy
    if @comment
      @comment.destroy

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 6]]
---
  def set_attributes
    @comment = Comment.find_by(id: params[:id]) unless params[:id].nil?
    @card = Card.find_by(id: params[:card_id])
    @list = List.find_by(id: params[:list_id])