app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    if current_user.admin?
      render json: { lists: List.all }, status: :ok

INSERT INTO "lists" ("title", "user_id") VALUES ($1, $2) RETURNING "id"  [["title", "list 1"], ["user_id", 6]]
---
  def create
    @list = List.new(list_params)
    @list.user = current_user
    if @list.save

UPDATE "lists" SET "title" = $1 WHERE "lists"."id" = $2  [["title", "title1 updateD!"], ["id", 25]]
---
  def update
    if @list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT 1  [["id", 6]]
---
  def set_list
    @list = List.find_by(id: params[:id])