app/controllers/users_controller.rb

INSERT INTO "list_users" ("user_id", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["list_id", 5], ["created_at", "2018-09-10 07:03:26.906687"], ["updated_at", "2018-09-10 07:03:26.906687"]]
---
  def assign_user_to_list
    if @assign
      render json: I18n.t('users.exsist_assing'), status: :ok
    else
      ListUser.create(assign_params)

SELECT  "list_users".* FROM "list_users" WHERE "list_users"."user_id" = $1 AND "list_users"."list_id" = $2 LIMIT 1  [["user_id", 5], ["list_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "5@a.com"]]
---
  def set_attributes
    @assign = ListUser.find_by(assign_params)